#Умова: Дано ціле число N - кількість хвилин, що пройшли з півночі.
# Скільки годин і хвилин буде показувати цифровий годинник, якщо за відлік хвилин взяти 00:00?
#Програма повинна виводити два числа: кількість годин (від 0 до 23) і кількість хвилин
# (від 0 до 59). Візьміть до уваги, що починаючи з півночі може пройти декілька днів, тому
# число N може бути достатньо великим.
#Вхідні дані: 1 ціле число
#Вихідні дані: вивести два числа. Перше - години, друге - хвилини.

print('Enter minutes:')
n = int(input())
a = n // 60 %24
b = n % 60
print('Hours', str(a))
print('Minutes', str(b))